src/oy7_by27_pr25_bp7/conf/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.Партии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/oy7_by27_pr25_bp7/conf/InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодСписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УчетнаяПолитика</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/oy7_by27_pr25_bp7/conf/AccumulationRegisters/Партии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Партии</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/oy7_by27_pr25_bp7/conf/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/oy7_by27_pr25_bp7/conf/Enums/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>УчетнаяПолитика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЛИФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФИФО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/oy7_by27_pr25_bp7/conf/Documents/РасходнаяНакладная/Ext/ManagerModule.bsl
Процедура РассчитатьСебестоимость(Ссылка) Экспорт
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	Если ДокументОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МетодСписания = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(ДокументОбъект.Дата).МетодСписания;
	Если НЕ ЗначениеЗаполнено(МетодСписания) Тогда
		ВызватьИсключение СтрШаблон("Не задана учетная политика на %1", НачалоГода(ДокументОбъект.Дата));
	КонецЕсли;
	
	Партии = ДокументОбъект.Движения.Партии;
	Продажи = ДокументОбъект.Движения.Продажи;
	
	Партии.Очистить();
	Продажи.Очистить();
	
	Партии.Записывать = Истина;
	Продажи.Записывать = Истина;
	
	Если НЕ ДокументОбъект.Проведен Тогда
		Партии.Записать();
		Продажи.Записать();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(Товары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)) КАК ЭтоТовар,
		|	СУММА(Товары.Количество) КАК Количество,
		|	СУММА(Товары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ втТЧ
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартииОстатки.Номенклатура КАК Номенклатура,
		|	ПартииОстатки.Партия КАК Партия,
		|	ПартииОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ПартииОстатки.СтоимостьОстаток КАК СтоимостьОстаток
		|ПОМЕСТИТЬ втПартии
		|ИЗ
		|	РегистрНакопления.Партии.Остатки(
		|			&МоментВремени,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					втТЧ.Номенклатура
		|				ИЗ
		|					втТЧ
		|				ГДЕ
		|					втТЧ.ЭтоТовар)) КАК ПартииОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧ.Номенклатура КАК Номенклатура,
		|	втТЧ.ЭтоТовар КАК ЭтоТовар,
		|	втТЧ.Количество КАК КоличествоПродажи,
		|	втТЧ.Сумма КАК СуммаПродажи,
		|	втПартии.Партия КАК Партия,
		|	втПартии.КоличествоОстаток КАК КоличествоОстаток,
		|	втПартии.СтоимостьОстаток КАК СтоимостьОстаток
		|ИЗ
		|	втТЧ КАК втТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПартии КАК втПартии
		|		ПО втТЧ.Номенклатура = втПартии.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	втПартии.Партия.МоментВремени УБЫВ
		|ИТОГИ
		|	МАКСИМУМ(ЭтоТовар),
		|	МАКСИМУМ(КоличествоПродажи),
		|	МАКСИМУМ(СуммаПродажи)
		|ПО
		|	Номенклатура");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Запрос.УстановитьПараметр("МоментВремени", ДокументОбъект.МоментВремени());
	
	Если МетодСписания = Перечисления.УчетнаяПолитика.ФИФО Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УБЫВ", "ВОЗР");
	КонецЕсли;
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
		ИтогоСебестоимость = 0;
		
		Если ВыборкаИтоги.ЭтоТовар Тогда
			ОсталосьСписать = ВыборкаИтоги.КоличествоПродажи;
			
			Выборка = ВыборкаИтоги.Выбрать();
			Пока Выборка.Следующий() И ОсталосьСписать > 0 Цикл
				Списать = Мин(ОсталосьСписать, Выборка.КоличествоОстаток);
				Себестоимость = ?(Списать = Выборка.КоличествоОстаток,
						Выборка.СтоимостьОстаток,
						Выборка.СтоимостьОстаток / Выборка.КоличествоОстаток * Списать);
				ИтогоСебестоимость = ИтогоСебестоимость + Себестоимость;
				ОсталосьСписать = ОсталосьСписать - Списать;
				
				Движение = Партии.ДобавитьРасход();
				Движение.Период			 = ДокументОбъект.Дата;
				Движение.Номенклатура	 = Выборка.Номенклатура;
				Движение.Партия			 = Выборка.Партия;
				Движение.Количество		 = Списать;
				Движение.Стоимость		 = Себестоимость;
			КонецЦикла;
		КонецЕсли;
		
		Движение = Продажи.Добавить();
		Движение.Период			 = ДокументОбъект.Дата;
		Движение.Номенклатура	 = ВыборкаИтоги.Номенклатура;
		Движение.Количество		 = ВыборкаИтоги.КоличествоПродажи;
		Движение.Себестоимость	 = ИтогоСебестоимость;
		Движение.Сумма			 = ВыборкаИтоги.СуммаПродажи;
	КонецЦикла;
	
	Партии.Записать();
	Продажи.Записать();
КонецПроцедуры
